garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF1PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF1PPS0" edc:mask="0x1" edc:name="RF1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS1" edc:mask="0x1" edc:name="RF1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS2" edc:mask="0x1" edc:name="RF1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS3" edc:mask="0x1" edc:name="RF1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS4" edc:mask="0x1" edc:name="RF1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS5" edc:mask="0x1" edc:name="RF1PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1PPS6" edc:mask="0x1" edc:name="RF1PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF2PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF2PPS0" edc:mask="0x1" edc:name="RF2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS1" edc:mask="0x1" edc:name="RF2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS2" edc:mask="0x1" edc:name="RF2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS3" edc:mask="0x1" edc:name="RF2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS4" edc:mask="0x1" edc:name="RF2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS5" edc:mask="0x1" edc:name="RF2PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2PPS6" edc:mask="0x1" edc:name="RF2PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF3PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF3PPS0" edc:mask="0x1" edc:name="RF3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS1" edc:mask="0x1" edc:name="RF3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS2" edc:mask="0x1" edc:name="RF3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS3" edc:mask="0x1" edc:name="RF3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS4" edc:mask="0x1" edc:name="RF3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS5" edc:mask="0x1" edc:name="RF3PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3PPS6" edc:mask="0x1" edc:name="RF3PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF4PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF4PPS0" edc:mask="0x1" edc:name="RF4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS1" edc:mask="0x1" edc:name="RF4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS2" edc:mask="0x1" edc:name="RF4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS3" edc:mask="0x1" edc:name="RF4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS4" edc:mask="0x1" edc:name="RF4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS5" edc:mask="0x1" edc:name="RF4PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4PPS6" edc:mask="0x1" edc:name="RF4PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF5PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF5PPS0" edc:mask="0x1" edc:name="RF5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS1" edc:mask="0x1" edc:name="RF5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS2" edc:mask="0x1" edc:name="RF5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS3" edc:mask="0x1" edc:name="RF5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS4" edc:mask="0x1" edc:name="RF5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS5" edc:mask="0x1" edc:name="RF5PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5PPS6" edc:mask="0x1" edc:name="RF5PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF6PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF6PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x22F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF6PPS0" edc:mask="0x1" edc:name="RF6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS1" edc:mask="0x1" edc:name="RF6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS2" edc:mask="0x1" edc:name="RF6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS3" edc:mask="0x1" edc:name="RF6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS4" edc:mask="0x1" edc:name="RF6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS5" edc:mask="0x1" edc:name="RF6PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6PPS6" edc:mask="0x1" edc:name="RF6PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RF7PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RF7PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x230">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF7PPS0" edc:mask="0x1" edc:name="RF7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS1" edc:mask="0x1" edc:name="RF7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS2" edc:mask="0x1" edc:name="RF7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS3" edc:mask="0x1" edc:name="RF7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS4" edc:mask="0x1" edc:name="RF7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS5" edc:mask="0x1" edc:name="RF7PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7PPS6" edc:mask="0x1" edc:name="RF7PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
