garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:AdjustPoint edc:offset="0x1" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x252"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWM1ERSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PWM1ERSPPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x253">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS" edc:mask="0x1f" edc:name="PWM1ERSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS0" edc:mask="0x1" edc:name="PWM1ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS1" edc:mask="0x1" edc:name="PWM1ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS2" edc:mask="0x1" edc:name="PWM1ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS3" edc:mask="0x1" edc:name="PWM1ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS4" edc:mask="0x1" edc:name="PWM1ERSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWM2ERSPPS" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWM2ERSPPS" edc:nzwidth="8" edc:por="--010101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x254">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS" edc:mask="0x3f" edc:name="PWM2ERSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS0" edc:mask="0x1" edc:name="PWM2ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS1" edc:mask="0x1" edc:name="PWM2ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS2" edc:mask="0x1" edc:name="PWM2ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS3" edc:mask="0x1" edc:name="PWM2ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS4" edc:mask="0x1" edc:name="PWM2ERSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS5" edc:mask="0x1" edc:name="PWM2ERSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWM3ERSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PWM3ERSPPS" edc:nzwidth="8" edc:por="---01111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x255">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS" edc:mask="0x1f" edc:name="PWM3ERSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS0" edc:mask="0x1" edc:name="PWM3ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS1" edc:mask="0x1" edc:name="PWM3ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS2" edc:mask="0x1" edc:name="PWM3ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS3" edc:mask="0x1" edc:name="PWM3ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3ERSPPS4" edc:mask="0x1" edc:name="PWM3ERSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x256"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWMIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWMIN0PPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x257">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS" edc:mask="0x3f" edc:name="PWMIN0PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS0" edc:mask="0x1" edc:name="PWMIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS1" edc:mask="0x1" edc:name="PWMIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS2" edc:mask="0x1" edc:name="PWMIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS3" edc:mask="0x1" edc:name="PWMIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS4" edc:mask="0x1" edc:name="PWMIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS5" edc:mask="0x1" edc:name="PWMIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PWMIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PWMIN1PPS" edc:nzwidth="8" edc:por="--010110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x258">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS" edc:mask="0x3f" edc:name="PWMIN1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS0" edc:mask="0x1" edc:name="PWMIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS1" edc:mask="0x1" edc:name="PWMIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS2" edc:mask="0x1" edc:name="PWMIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS3" edc:mask="0x1" edc:name="PWMIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS4" edc:mask="0x1" edc:name="PWMIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS5" edc:mask="0x1" edc:name="PWMIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SMT1WINPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SMT1WINPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x259">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1WINPPS" edc:mask="0x3f" edc:name="SMT1WINPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1WINPPS0" edc:mask="0x1" edc:name="SMT1WINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1WINPPS1" edc:mask="0x1" edc:name="SMT1WINPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1WINPPS2" edc:mask="0x1" edc:name="SMT1WINPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1WINPPS3" edc:mask="0x1" edc:name="SMT1WINPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1WINPPS4" edc:mask="0x1" edc:name="SMT1WINPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1WINPPS5" edc:mask="0x1" edc:name="SMT1WINPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SMT1SIGPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SMT1SIGPPS" edc:nzwidth="8" edc:por="--010001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x25A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS" edc:mask="0x3f" edc:name="SMT1SIGPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS0" edc:mask="0x1" edc:name="SMT1SIGPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS1" edc:mask="0x1" edc:name="SMT1SIGPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS2" edc:mask="0x1" edc:name="SMT1SIGPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS3" edc:mask="0x1" edc:name="SMT1SIGPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS4" edc:mask="0x1" edc:name="SMT1SIGPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS5" edc:mask="0x1" edc:name="SMT1SIGPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
