garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR8" edc:mask="0x1" edc:name="HADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR9" edc:mask="0x1" edc:name="HADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR10" edc:mask="0x1" edc:name="HADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR11" edc:mask="0x1" edc:name="HADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR12" edc:mask="0x1" edc:name="HADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR13" edc:mask="0x1" edc:name="HADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR14" edc:mask="0x1" edc:name="HADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR15" edc:mask="0x1" edc:name="HADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR8" edc:mask="0x1" edc:name="SCANHADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR9" edc:mask="0x1" edc:name="SCANHADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR10" edc:mask="0x1" edc:name="SCANHADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR11" edc:mask="0x1" edc:name="SCANHADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR12" edc:mask="0x1" edc:name="SCANHADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR13" edc:mask="0x1" edc:name="SCANHADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR14" edc:mask="0x1" edc:name="SCANHADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR15" edc:mask="0x1" edc:name="SCANHADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANHADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="SCANHADRU" edc:nzwidth="8" edc:por="--111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0x3f" edc:name="HADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR16" edc:mask="0x1" edc:name="HADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR17" edc:mask="0x1" edc:name="HADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR18" edc:mask="0x1" edc:name="HADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR19" edc:mask="0x1" edc:name="HADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR20" edc:mask="0x1" edc:name="HADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR21" edc:mask="0x1" edc:name="HADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0x3f" edc:name="SCANHADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR16" edc:mask="0x1" edc:name="SCANHADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR17" edc:mask="0x1" edc:name="SCANHADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR18" edc:mask="0x1" edc:name="SCANHADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR19" edc:mask="0x1" edc:name="SCANHADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR20" edc:mask="0x1" edc:name="SCANHADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR21" edc:mask="0x1" edc:name="SCANHADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="SCANCON0" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--100" edc:name="SCANCON0" edc:nzwidth="8" edc:por="000--100" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x360">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BURSTMD" edc:mask="0x1" edc:name="BURSTMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MREG" edc:mask="0x1" edc:name="MREG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SGO" edc:desc="" edc:mask="0x1" edc:name="SGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="SCANEN" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SCANTRIG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SCANTRIG" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x361">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0x1f" edc:name="TSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEL0" edc:desc="" edc:mask="0x1" edc:name="TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL1" edc:desc="" edc:mask="0x1" edc:name="TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL2" edc:desc="" edc:mask="0x1" edc:name="TSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL3" edc:desc="" edc:mask="0x1" edc:name="TSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL4" edc:desc="" edc:mask="0x1" edc:name="TSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANTSEL" edc:desc="" edc:mask="0x1f" edc:name="SCANTSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnnn" edc:cname="IPR0" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000" edc:name="IPR0" edc:nzwidth="8" edc:por="0-0-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x362">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIP" edc:mask="0x1" edc:name="SWIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIP" edc:mask="0x1" edc:name="HLVDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIP" edc:mask="0x1" edc:name="OSFIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIP" edc:mask="0x1" edc:name="CSWIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC1IP" edc:mask="0x1" edc:name="CLC1IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCIP" edc:mask="0x1" edc:name="IOCIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x363">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IP" edc:mask="0x1" edc:name="INT0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDIP" edc:mask="0x1" edc:name="ZCDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIP" edc:mask="0x1" edc:name="ADIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIP" edc:mask="0x1" edc:name="ACTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IP" edc:mask="0x1" edc:name="C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1IP" edc:mask="0x1" edc:name="SMT1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PRAIP" edc:mask="0x1" edc:name="SMT1PRAIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PWAIP" edc:mask="0x1" edc:name="SMT1PWAIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
