garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="xx000000" edc:_modsrc="DOS-02541_amp_fvr_ts_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x3D7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="ADCPCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------0" edc:name="ADCPCON" edc:nzwidth="8" edc:por="x------x" edc:_addr="0x3D8">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ADCP"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRDY" edc:mask="0x1" edc:name="CPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCPRDY" edc:mask="0x1" edc:name="ADCPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="ADCPON" edc:mask="0x1" edc:name="ADCPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADLTH" edc:desc="" edc:name="ADLTH" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3D9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3D9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH0" edc:desc="" edc:mask="0x1" edc:name="ADLTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH1" edc:desc="" edc:mask="0x1" edc:name="ADLTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH2" edc:desc="" edc:mask="0x1" edc:name="ADLTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH3" edc:desc="" edc:mask="0x1" edc:name="ADLTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH4" edc:desc="" edc:mask="0x1" edc:name="ADLTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH5" edc:desc="" edc:mask="0x1" edc:name="ADLTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH6" edc:desc="" edc:mask="0x1" edc:name="ADLTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH7" edc:desc="" edc:mask="0x1" edc:name="ADLTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH0" edc:mask="0x1" edc:name="LTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH1" edc:mask="0x1" edc:name="LTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH2" edc:mask="0x1" edc:name="LTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH3" edc:mask="0x1" edc:name="LTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH4" edc:mask="0x1" edc:name="LTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH5" edc:mask="0x1" edc:name="LTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH6" edc:mask="0x1" edc:name="LTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH7" edc:mask="0x1" edc:name="LTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
