garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEN" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEN" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x426">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEN3" edc:mask="0x1" edc:name="IOCEN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEF" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x427">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELF" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x428">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELF0" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF1" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF2" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF3" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF4" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF5" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF6" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF7" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x429">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUF0" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF1" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF2" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF3" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF4" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF5" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF6" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF7" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x42A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCF0" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF1" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF2" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF3" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF4" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF5" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF6" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF7" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONF" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x42B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRF0" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF1" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF2" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF3" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF4" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF5" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF6" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF7" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
