garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:JoinedSFRDef edc:cname="PWM3S1P2" edc:desc="" edc:name="PWM3S1P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2L" edc:mask="0xff" edc:name="S1P2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3S1P2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3S1P2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x48C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="S1P2H" edc:mask="0xff" edc:name="S1P2H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0xF" edc:_addr="0x48D"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMLOAD" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMLOAD" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x49C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1LD" edc:mask="0x1" edc:name="MPWM1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2LD" edc:mask="0x1" edc:name="MPWM2LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3LD" edc:mask="0x1" edc:name="MPWM3LD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PWMEN" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PWMEN" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x49D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1EN" edc:mask="0x1" edc:name="MPWM1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2EN" edc:mask="0x1" edc:name="MPWM2EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM3EN" edc:mask="0x1" edc:name="MPWM3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnnn" edc:cname="PIE0" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000" edc:name="PIE0" edc:nzwidth="8" edc:por="0-0-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x49E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIE" edc:mask="0x1" edc:name="SWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x49F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIE" edc:mask="0x1" edc:name="ACTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IE" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1IE" edc:mask="0x1" edc:name="SMT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PRAIE" edc:mask="0x1" edc:name="SMT1PRAIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1PWAIE" edc:mask="0x1" edc:name="SMT1PWAIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn---n" edc:cname="PIE2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="PIE2" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTIE" edc:mask="0x1" edc:name="ADTIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIE" edc:mask="0x1" edc:name="DMA1SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIE" edc:mask="0x1" edc:name="DMA1DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIE" edc:mask="0x1" edc:name="DMA1ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIE" edc:mask="0x1" edc:name="DMA1AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="PIE4" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="PIE4" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIE" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IE" edc:mask="0x1" edc:name="U1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM1PIE" edc:mask="0x1" edc:name="PWM1PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="PIE5" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIE5" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IE" edc:mask="0x1" edc:name="SPI2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR3IE" edc:mask="0x1" edc:name="TMR3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIE" edc:mask="0x1" edc:name="TMR3GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIE" edc:mask="0x1" edc:name="PWM2PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IE" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IE" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IE" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IE" edc:mask="0x1" edc:name="CWG1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IE" edc:mask="0x1" edc:name="NCO1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIE" edc:mask="0x1" edc:name="DMA2SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIE" edc:mask="0x1" edc:name="DMA2DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIE" edc:mask="0x1" edc:name="DMA2ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIE" edc:mask="0x1" edc:name="DMA2AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="PIE7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIE7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIE" edc:mask="0x1" edc:name="I2C1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIE" edc:mask="0x1" edc:name="I2C1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IE" edc:mask="0x1" edc:name="I2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIE" edc:mask="0x1" edc:name="I2C1EIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IE" edc:mask="0x1" edc:name="CLC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIE" edc:mask="0x1" edc:name="PWM3PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IE" edc:mask="0x1" edc:name="PWM3IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu000" edc:name="PIE8" edc:nzwidth="8" edc:por="xxxxx000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIE" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IE" edc:mask="0x1" edc:name="U2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IE" edc:mask="0x1" edc:name="TMR5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIE" edc:mask="0x1" edc:name="TMR5GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIE" edc:mask="0x1" edc:name="SCANIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n-nnnn" edc:cname="PIE9" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u-uuuu" edc:name="PIE9" edc:nzwidth="8" edc:por="--x-xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U3RXIE" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIE" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3EIE" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3IE" edc:mask="0x1" edc:name="U3IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IE" edc:mask="0x1" edc:name="CLC4IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIE10" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IE" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IE" edc:mask="0x1" edc:name="CLC5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2IE" edc:mask="0x1" edc:name="CWG2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2IE" edc:mask="0x1" edc:name="NCO2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIE" edc:mask="0x1" edc:name="DMA3SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIE" edc:mask="0x1" edc:name="DMA3DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIE" edc:mask="0x1" edc:name="DMA3ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIE" edc:mask="0x1" edc:name="DMA3AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIE11" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IE" edc:mask="0x1" edc:name="CCP3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6IE" edc:mask="0x1" edc:name="CLC6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3IE" edc:mask="0x1" edc:name="CWG3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIE" edc:mask="0x1" edc:name="DMA4SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIE" edc:mask="0x1" edc:name="DMA4DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIE" edc:mask="0x1" edc:name="DMA4ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIE" edc:mask="0x1" edc:name="DMA4AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIE12" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U4RXIE" edc:mask="0x1" edc:name="U4RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4TXIE" edc:mask="0x1" edc:name="U4TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4EIE" edc:mask="0x1" edc:name="U4EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4IE" edc:mask="0x1" edc:name="U4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5SCNTIE" edc:mask="0x1" edc:name="DMA5SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5DCNTIE" edc:mask="0x1" edc:name="DMA5DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5ORIE" edc:mask="0x1" edc:name="DMA5ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5AIE" edc:mask="0x1" edc:name="DMA5AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PIE13" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4AB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U5RXIE" edc:mask="0x1" edc:name="U5RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5TXIE" edc:mask="0x1" edc:name="U5TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5EIE" edc:mask="0x1" edc:name="U5EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5IE" edc:mask="0x1" edc:name="U5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6SCNTIE" edc:mask="0x1" edc:name="DMA6SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6DCNTIE" edc:mask="0x1" edc:name="DMA6DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6ORIE" edc:mask="0x1" edc:name="DMA6ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6AIE" edc:mask="0x1" edc:name="DMA6AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnn-" edc:cname="PIE14" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuu-" edc:name="PIE14" edc:nzwidth="8" edc:por="----xxx-" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC7IE" edc:mask="0x1" edc:name="CLC7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3IE" edc:mask="0x1" edc:name="NCO3IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PIE15" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PIE15" edc:nzwidth="8" edc:por="----xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x4AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IE" edc:mask="0x1" edc:name="CLC8IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
