garyPenhook/PIC-Assembler/edc/PIC18F55Q43.PIC
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR3_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3_Internal" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx" edc:nmmrid="14">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR3_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="21">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0x0000" edc:endaddr="0x0038" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:beginaddr="0x0500" edc:endaddr="0x0560" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x0500" edc:endaddr="0x0560" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:DMASpace>
    <edc:SFRDataSector edc:beginaddr="0x4000" edc:endaddr="0x4100" edc:regionid="sfr64">
      <edc:RegisterMirror edc:cnameref="CCPR1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR3L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR3H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x04"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2H" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x04"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1PRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2PRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3PRH" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x0E"/>
      <edc:RegisterMirror edc:cnameref="CCPR1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="CCPR1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="T2PR" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="CCPR2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="T4PR" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR3L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="CCPR3H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="T6PR" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x17"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCON0" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCON1" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCON2" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCON3" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADREF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACT" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCLK" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x62"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="M2"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x4100" edc:endaddr="0x4200" edc:regionid="sfr65">
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA5"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA6"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA6"/>
      <edc:AdjustPoint edc:offset="0x56"/>
      <edc:RegisterMirror edc:cnameref="IOCAF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCBF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCCF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCEF" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x12"/>
      <edc:RegisterMirror edc:cnameref="TMR1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR3L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR3H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR5L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="TMR5H" edc:cnamesuffix="M1"/>
    </edc:SFRDataSector>
  </edc:DMASpace>
  <edc:PinList edc:desc="PIC1857Q43 48-pin." edc:ppsflavor="complex-port">
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA0"/>
      <edc:VirtualPin edc:name="C1IN0-"/>
      <edc:VirtualPin edc:name="C2IN0-"/>
      <edc:VirtualPin edc:name="IOCA0"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA1"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="IOCA1"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DAC1OUT1"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="ANA2"/>
      <edc:VirtualPin edc:name="C1IN0+"/>
      <edc:VirtualPin edc:name="C2IN0+"/>
      <edc:VirtualPin edc:name="IOCA2"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="ANA3"/>
      <edc:VirtualPin edc:name="C1IN1+"/>
      <edc:VirtualPin edc:name="IOCA3"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA4"/>
      <edc:VirtualPin edc:name="IOCA4"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA5"/>
      <edc:VirtualPin edc:name="IOCA5"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="ANA6"/>
      <edc:VirtualPin edc:name="IOCA6"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="ANA7"/>
      <edc:VirtualPin edc:name="IOCA7"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ZCD"/>
      <edc:VirtualPin edc:name="ANB0"/>
      <edc:VirtualPin edc:name="C2IN1+"/>
      <edc:VirtualPin edc:name="IOCB0"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB1"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="IOCB1"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB2"/>
      <edc:VirtualPin edc:name="SMB_I2C"/>
      <edc:VirtualPin edc:name="IOCB2"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB3"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
      <edc:VirtualPin edc:name="IOCB3"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB4"/>
      <edc:VirtualPin edc:name="IOCB4"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB5"/>
      <edc:VirtualPin edc:name="IOCB5"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ICSPCLK"/>
      <edc:VirtualPin edc:name="ICDCLK"/>
      <edc:VirtualPin edc:name="ANB6"/>
      <edc:VirtualPin edc:name="IOCB6"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
